# Pandas Series

In [6]:
import pandas as pd
a1=pd.Series([4,8,3,7])
print(a1)

0    4
1    8
2    3
3    7
dtype: int64

# Pandas Series has Values and Indexes

In [12]:
import pandas as pd
a1=pd.Series([40,80,30,70])
print('Values',a1.values)
print('Indexes',a1.index)
a1

Values [40 80 30 70]
Indexes RangeIndex(start=0, stop=4, step=1)

0    40
1    80
2    30
3    70
dtype: int64

# Non Numeric Index

In [15]:
a1=pd.Series([40,80,30,70],index=['Jan','Feb','Mar','Apr'])
print('Values',a1.values)
print('Indexes',a1.index)
a1

Values [40 80 30 70]
Indexes Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')

Jan    40
Feb    80
Mar    30
Apr    70
dtype: int64

In [18]:
a1=pd.Series([40,80,30,70],index=['Jan','Feb','Mar','Apr'],name='Generate Random Data') #Adding Name
print('Values',a1.values)
print('Indexes',a1.index)
a1

Values [40 80 30 70]
Indexes Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')

Jan    40
Feb    80
Mar    30
Apr    70
Name: Generate Random Data, dtype: int64

In [22]:
a2=pd.Series([10,15,7,18,11,9,0],
             index=['Mon','Tues','Wed','Thurs','Fri','Sat','Sun'],
             name='Canteen weekly data of Switches Sales')
a2

Mon      10
Tues     15
Wed       7
Thurs    18
Fri      11
Sat       9
Sun       0
Name: Canteen weekly data of Switches Sales, dtype: int64

In [23]:
print(a2['Wed'])   #pick data by name and by index
print(a2[2])

7
7

In [28]:
print(a2[[2,4]]) #multipl selection
print(a2[['Sun','Sat']])

Wed     7
Fri    11
Name: Canteen weekly data of Switches Sales, dtype: int64
Sun    0
Sat    9
Name: Canteen weekly data of Switches Sales, dtype: int64

In [30]:
print(a2[a2>10]) #Condition apply

Tues     15
Thurs    18
Fri      11
Name: Canteen weekly data of Switches Sales, dtype: int64

In [32]:
a3=a2*2    #values multiply by 2
print(a2)
a3

Mon      10
Tues     15
Wed       7
Thurs    18
Fri      11
Sat       9
Sun       0
Name: Canteen weekly data of Switches Sales, dtype: int64

Mon      20
Tues     30
Wed      14
Thurs    36
Fri      22
Sat      18
Sun       0
Name: Canteen weekly data of Switches Sales, dtype: int64

In [33]:
a3/2  #we can also perform arithmatic operation

Mon      10.0
Tues     15.0
Wed       7.0
Thurs    18.0
Fri      11.0
Sat       9.0
Sun       0.0
Name: Canteen weekly data of Switches Sales, dtype: float64

In [34]:
'Fri' in a2  #find whether the index is in series or not

True

# Create Panda Series by using array

In [36]:
import numpy as np
val=np.array([3,5,0,7,1])
ind=np.array(['a','b','c','d','e'])
a4=pd.Series(val,index=ind)
a4

a    3
b    5
c    0
d    7
e    1
dtype: int32

# Pandas Series by Dictionary

In [40]:
sdata={'Sindh':30000, 'Punjab':20000,'KPK':15000,'Balochistan':7000}
a5=pd.Series(sdata)
print(a5)
print(a5.index)

Sindh          30000
Punjab         20000
KPK            15000
Balochistan     7000
dtype: int64
Index(['Sindh', 'Punjab', 'KPK', 'Balochistan'], dtype='object')

In [41]:
sdata={'Sindh':30000, 'Punjab':20000,'KPK':15000,'Balochistan':7000}
a5=pd.Series(sdata, index=['Balochistan', 'Sindh','Punjab','KPK'])   #Index Shuffle but data same
print(a5)
print(a5.index)

Balochistan     7000
Sindh          30000
Punjab         20000
KPK            15000
dtype: int64
Index(['Balochistan', 'Sindh', 'Punjab', 'KPK'], dtype='object')

In [45]:
sdata={'Sindh':30000, 'Punjab':20000,'KPK':15000,'Balochistan':7000}
a5=pd.Series(sdata, index=['Balochistan', 'Sindh','Punjab','KPK','Gilgit'])   #Mising data we increased 1 index
print(a5)
print(a5.index)
#print(pd.isnull(a5))  #Check the null values it give true when NaN is available. Null is value which is not present in series
a5.isnull()  #Both commands are same pd.isnull is function and a5.isnull is a method

Balochistan     7000.0
Sindh          30000.0
Punjab         20000.0
KPK            15000.0
Gilgit             NaN
dtype: float64
Index(['Balochistan', 'Sindh', 'Punjab', 'KPK', 'Gilgit'], dtype='object')

Balochistan    False
Sindh          False
Punjab         False
KPK            False
Gilgit          True
dtype: bool

In [48]:
a5.name='Tax paying state'
a5.index.name='State Names'  #update index name
print(a5)

State Names
Balochistan     7000.0
Sindh          30000.0
Punjab         20000.0
KPK            15000.0
Gilgit             NaN
Name: Tax paying state, dtype: float64

In [49]:
a5.index=['B','S','P','K','G']  #Index update
print(a5)

B     7000.0
S    30000.0
P    20000.0
K    15000.0
G        NaN
Name: Tax paying state, dtype: float64

# Pandas DataFrame

In [3]:
import pandas as pd
boy=pd.Series([15,18,25,30],index=['Class I','Class II','Class III','Class IV'])  #length of Both Series Indexes should be the same
girl=pd.Series([13,11,15,20],index=['Class I','Class II','Class III','Class IV'])
data={'No.of Boys':boy,'No.of Girls':girl}
final_data=pd.DataFrame(data)
print(final_data)

           No.of Boys  No.of Girls
Class I            15           13
Class II           18           11
Class III          25           15
Class IV           30           20

In [32]:
data={'Country':['England','China','USA','France','Germany','India','Canada'], 'Year':[2005,2006,2007,2008,2009,2010,2011],
      'Literacy':[75,85.5,95.2,83.7,88.6,90.1,96.2]}
frame=pd.DataFrame(data, index=['1st','2nd','3rd','4th','5th','6th','7th'])
display(frame)

     Country  Year  Literacy
1st  England  2005      75.0
2nd    China  2006      85.5
3rd      USA  2007      95.2
4th   France  2008      83.7
5th  Germany  2009      88.6
6th    India  2010      90.1
7th   Canada  2011      96.2

In [42]:
frame.head() #it print the first five rows of ur data

     Country  Year  Literacy
1st  England  2005      75.0
2nd    China  2006      85.5
3rd      USA  2007      95.2
4th   France  2008      83.7
5th  Germany  2009      88.6

In [43]:
frame4=pd.DataFrame(data,columns=['Year','Literacy','Country'],index=['1st','2nd','3rd','4th','5th','6th','7th']) #we can change the position as well
frame4

     Year  Literacy  Country
1st  2005      75.0  England
2nd  2006      85.5    China
3rd  2007      95.2      USA
4th  2008      83.7   France
5th  2009      88.6  Germany
6th  2010      90.1    India
7th  2011      96.2   Canada

In [46]:
frame1=pd.DataFrame(data,columns=['Year','Literacy','Country','Economy'],index=['1st','2nd','3rd','4th','5th','6th','7th']) #adding new column
frame1

     Year  Literacy  Country Economy
1st  2005      75.0  England     NaN
2nd  2006      85.5    China     NaN
3rd  2007      95.2      USA     NaN
4th  2008      83.7   France     NaN
5th  2009      88.6  Germany     NaN
6th  2010      90.1    India     NaN
7th  2011      96.2   Canada     NaN

In [47]:
print(frame1.columns)
print(frame1.index)

Index(['Year', 'Literacy', 'Country', 'Economy'], dtype='object')
Index(['1st', '2nd', '3rd', '4th', '5th', '6th', '7th'], dtype='object')

In [48]:
#print(data)
#data['Country']  #Dictionary like notation to access data
frame1['Year'] #Dataframe column data

1st    2005
2nd    2006
3rd    2007
4th    2008
5th    2009
6th    2010
7th    2011
Name: Year, dtype: int64

In [49]:
frame1.Country #attribute style

1st    England
2nd      China
3rd        USA
4th     France
5th    Germany
6th      India
7th     Canada
Name: Country, dtype: object

In [54]:
frame1.loc['2nd','Country'] # f.loc(row,columm)
#frame1.loc['2nd',['Literacy','Year']] #give row index name which we want to access bcz loc function allows row name instead of default index like (0,1,2...) .

'China'

In [56]:
frame1.loc['3rd':'6th':2] #just like slicing they give row between 2 to 6 and step size 2 (frame.loc[start:end:stepsize])

     Year  Literacy  Country Economy
3rd  2007      95.2      USA     NaN
5th  2009      88.6  Germany     NaN

In [71]:
frame1.iloc[1:4]    #in iloc function u can access data through its default index
frame1.iloc[2:5:1,1:3:1]

     Literacy  Country
3rd      95.2      USA
4th      83.7   France
5th      88.6  Germany

In [23]:
print(len(frame1)) #it give the total number of rows

7

In [28]:
#Add New column through numpy array
import numpy as np
ln=len(frame1)
rang=np.arange(ln)
frame1['debt']=rang
frame1

   Year  Literacy  Country Economy  debt
0  2005      75.0  England     NaN     0
1  2006      85.5    China     NaN     1
2  2007      95.2      USA     NaN     2
3  2008      83.7   France     NaN     3
4  2009      88.6  Germany     NaN     4
5  2010      90.1    India     NaN     5
6  2011      96.2   Canada     NaN     6

In [34]:
val=pd.Series([1.5,-0.3,5.4,-7.7,-1.4,2.6,3.5],
              index=[0,1,2,3,4,5,6]) #Dataframe index and Series index must be the same name and same in length
frame1['debt']=val
frame1

   Year  Literacy  Country Economy  debt
0  2005      75.0  England     NaN   1.5
1  2006      85.5    China     NaN  -0.3
2  2007      95.2      USA     NaN   5.4
3  2008      83.7   France     NaN  -7.7
4  2009      88.6  Germany     NaN  -1.4
5  2010      90.1    India     NaN   2.6
6  2011      96.2   Canada     NaN   3.5

In [35]:
val=pd.Series([1.5,-0.3,5.4,-7.7,-1.4,2.6,3.5],
              index=[0,1,2,3,4,5,'six']) #Dataframe index and Series index must be the same name and same in length
frame1['debt']=val              #If we change the name of any index but same in lenth then it give NaN value at that position
frame1

   Year  Literacy  Country Economy  debt
0  2005      75.0  England     NaN   1.5
1  2006      85.5    China     NaN  -0.3
2  2007      95.2      USA     NaN   5.4
3  2008      83.7   France     NaN  -7.7
4  2009      88.6  Germany     NaN  -1.4
5  2010      90.1    India     NaN   2.6
6  2011      96.2   Canada     NaN   NaN

# Function, Application and Mapping of Pandas

In [31]:
import numpy as np
import pandas as pd
frame=pd.DataFrame(np.random.randn(4,3),columns=list('abc'),index=['utah','Ohio','Texas','oregon'])
print(frame)
#print(frame['a'].min())
#print(frame['a'].max())
#print(frame['a'].max()-frame['a'].min())

f=lambda x:x.max()-x.min() #By Lambda function and apply command #for subracted valye of a,b and c
df=frame.apply(f)
df1=frame.apply(f,axis=0) 
print(df1)

def min_max(x):   #By normal function
    minimum=x.min()
    maximum=x.max()
    return pd.Series([x.max()-x.min()], index=['min-min'])
df3=frame.apply(min_max)
print(df3)

               a         b         c
utah   -0.010115 -0.839829 -0.260866
Ohio    1.236570  0.431994 -0.416330
Texas   0.412390  0.582440 -0.666989
oregon  0.061670  1.810654 -0.610383
a    1.246685
b    2.650483
c    0.406123
dtype: float64
                a         b         c
min-min  1.246685  2.650483  0.406123

# Arithmetic Operation on Dataframe

In [72]:
df=pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df1=pd.DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
print(df)
print(df1)
df2=df1+df  #Every index of first df have to be added in index of second df, those index which is not common in both df gives the NaN value
print(df2)

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8
        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11
            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

# Arithmetic Operation with Fill values

In [76]:
df=pd.DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))
df1=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))
print(df)
print(df1)
#df1.loc[1,'b']=np.nan
#print(df1)

print('Addition using a method with replacing NaN is 0')
df2=df.add(df1,fill_value=0) #this value replace NaN value to zero and then add
print(df2)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
Addition using a method with replacing NaN is 0
      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

# Arithmetic Operation between Dataframe and Series

In [77]:
df5=pd.DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
print(df5)
print('Using New Series')
series=pd.Series([1,2,3],index=list('bde'))
print(series.values,series.index)
a=df5-series
print(a)

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11
Using New Series
[1 2 3] Index(['b', 'd', 'e'], dtype='object')
        b  d  e
Utah   -1 -1 -1
Ohio    2  2  2
Texas   5  5  5
Oregon  8  8  8